import 'dart:developer';

import 'package:flutter/material.dart';
import 'package:shared_preferences/shared_preferences.dart';

class MyDialog extends StatefulWidget {
  const MyDialog({
    Key? key,
  }) : super(key: key);

  @override
  State<MyDialog> createState() => _MyDialogState();
}

class _MyDialogState extends State<MyDialog> {
  List<String> hadith = [
    " الباقيات الصالحات : سبحان الله والحمد لله ، ولا إله إلا الله ،والله أكبر ،و لا حول ولا قوة إلا بالله ",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "يا ربنا لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك.",
    "مَن ذُكِرْتُ عندْهُ, فَنسِيَ الصَّلاةَ عليَّ, خَطِىءَ بهِ طريقُ الجنَّةِ",
    " إن أفضل الذكر لا إله إلا الله ",
    "سبحان الله عدد ما خلق في السماء، وسبحان الله عدد ما خلق في الأرض، وسبحان الله عدد ما بين ذلك، وسبحان الله عدد ما هو خالق، والله أكبر مثل ذلك، والحمد لله مثل ذلك، ولا حول ولا قوة إلا بالله مثل ذلك.",
    "سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته.",
    "وقال صلى الله عيه وسلم : كلمتان خفيفتان على اللسان ، ثقيلتان في الميزان حبيبتان إلى الرحمن : سبحان الله وبحمده سبحان الله العظيم ",
    "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
    "اللهم لا تجعل الدنيا أكبر همنا ولا مبلغ علمنا.",
    "قال صلى الله عليه وسلم:  من صلى علي صلاة صلى الله عليه بها عشراً ",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "اللهم فقهني في الدين",
    "اللهم أصلح لنا ديننا الذي هو عصمة أمرنا، وأصلح لنا دنيانا التي فيها معاشنا، وأصلح لنا آخرتنا التي إليها معادنا، واجعل الحياة زيادة لنا في كل خير، واجعل الموت راحة لنا من كل شر.",
    "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري.",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "وقال صلى الله عيه وسلم :  أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء",
    "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "قال صلى الله عليه وسلم:  من صلى علي صلاة صلى الله عليه بها عشراً ",
    "وقال صلى الله عيه وسلم:  يا عبد الله بن قيس ألا أدلك على كنز من كنوز الجنة ؟  فقلت:بلى يا رسول الله ، قال : قل لا حول ولا قوة إلا بالله ",
    "وقال صلى الله عيه وسلم: أحب الكلام إلى الله أربعٌ : سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، لا يضرك بأيهنَّ بدأت ",
    "إلهي ! كل فرح بغيرك زائل ، وكل شغل بسواك باطل ، والسرور بك هو السرور ، والسرور بغيرك هو الزور والغرور.",
    "وقال صلى الله عليه وسلم: ما من أحد يسلم علي إلا رد الله على روحي حتى أرد عليه السلام",
    "اللهم قنعني بما رزقتني وبارك لي فيه واخلف عليَّ كُلَّ غائبةٍ بخير.",
    "وقال صلى الله عيه وسلم : لأن أقول سبحان الله ، والحمد لله ،ولا إله إلا الله ، والله أكبر ،أحب إلى مما طلعت عليه الشمس ",
    "اللهم أعنا على ذكرك، وشكرك، وحسن عبادتك",
    "اللهم اجعلنا ممن توكل عليك فكفيته واستهداك فهديته واستغفرك فغفرت له واستنصرك فنصرته ودعاك فأجبته.",
    "اللهم أعني على ما ينجيني مم خوفتني منه وارزقني شوق الصالحين إلى ماشوقتهم إليه.",
    "عن عبد الله بن عمرو رضي الله عنهما قال : رأيت النبي صلى الله عليه وسلم يعقد التسبيح بيمينه",
    "اللهم فقهني في الدين",
    "قال صلى الله عليه وسلم:  من صلى علي صلاة صلى الله عليه بها عشراً ",
    " من قال أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه ، غفر الله لهُ وإن كان فر من الزحف ",
    "إلهي: فأي نعمك أحصي عدده، وأي عطائك أقوم بشكره: ما أسبغت علي من النعماء، أو ما صرفت عني من الضراء",
    "لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "اللهم إني أسألك صحة في إيمان، وإيمانا في حسن خلق، ونجاحا يتبعه فلاح، ورحمة منك وعافية، ومغفرة منك ورضوانا",
    "اللهم إن ذنوبي عظام وهي صغار في جنب عفوك يا كريم ، فاغفرها لي.",
    "اللهم اهدنا لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم.",
    "قال صلى الله عليه وسلم:  من صلى علي صلاة صلى الله عليه بها عشراً ",
    "اللهم انفعني بما علمتني ، وعلمني ما ينفعني ، وزدني علما.",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "اللهم ألهمني رشدي، وأعذني من شر نفسي",
    "وقال صلى الله عليه وسلم  إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام ",
    "اللهم إني أعوذ بك أن أقول زورا ، أو أغشى فجورا ، أو أكون بك مغرورا.",
    "اللهم إني أسألك فواتح الخير ، وخواتـمه ، وجوامعه ، وأوله ، وظاهره ، وباطنه ، والدرجات العلى من الجنة.",
    "رب أعني ولا تعن علي ، وانصرني ولا تنصر علي ، وامكر لي ولا تمكر علي ، واهدني ويسر الهدى إلي ، وانصرني على من بغى علي .",
    "اللهم إنا نسألك يسرا ليس بعده عسر ، وغنى ليس بعده فقر ، وأمنا ليس بعده خوف ، وسعادة ليس بعدها شقاء .",
    "اللهم أعنا على شهوات أنفسنا، وقسوة قلوبنا ، وضعف إرادتنا ، ولا تكلنا إلى أنفسنا ولا إلى أحد غيرك.",
    "رَبَّنَا آمَنَّا بِمَا أَنزَلَتْ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
    "اللهم اشغل قلوبنا بحبك ، وألسنتنا بذكرك  وأبداننا بطاعتك ، وعقولنا بالتفكر في خلقك والتفقه في دينك.",
    "عن ابن عمر رضي الله عنهما قال:  إن كنا لنعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة: رب اغفر لي وتب علي، إنك أنت التواب الرحيم",
    "أعوذ بكلمات الله التامات من شر ما خلق",
    "اللهم إني أسألك عيشة نقية، وميتة سوية، ومردا غير مخز ولا فاضح",
    " اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً ",
    " اللهم إني أعوذ بك من الهم والحزن  والعجز والكسل والبخل والجبن  وضلع الدين وغلبة الرجال ",
    "لا إله إلا أنت سبحانك وبحمدك، رب عملت سوءا وظلمت نفسي فاغفر لي إنك أنت الغفور الرحيم.",
    "وقال صلى الله عليه وسلم :  لا تجعلوا قبري عيداً وصلوا علي ؛ فإن صلاتكم تبلغني حيث كنتم ",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "الله اكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا.",
    "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
    "اللهم لك الحمد كله وإليك يرجع الأمر كله، فاغفر لنا ذنبنا كله وأصلح لنا شأننا كله.",
    "قال صلى الله عليه وسلم:  من صلى علي صلاة صلى الله عليه بها عشراً ",
    "اللهم فقهني في الدين",
    "الحمد لله حمداً كثيراً طيباً مباركاً فيه كما يحب ربنا ويرضى.",
    "رَبَّنَا آمَنَّا بِمَا أَنزَلَتْ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
    "الحمد لله حمد الشاكرين، والحمد لله في كل وقت وحين. الحمد لله حمداً على كل النعم.. والحمد لله على حمد النعم.. والحمد لله حمداً يليق برب النعم.. فيا ربنا لك الحمد.",
    "اللَّهُمَّ أحيني على سنة نبيك محمّد صلى الله عليه وسلم وتوفني على ملته وأعذني من مضلات الفتن.",
    "اللَّهُمَّ أسألك علما نافعا ورزقا واسعا وشفاء من كل داء.",
    "قال صلى الله عليه وسلم:  من صلى علي صلاة صلى الله عليه بها عشراً ",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
    "اللَّهُمَّ اجعلني شكورا ، واسجعلني صبورا ، واجعلني في عيني صغيرا وفي أعين الناس كبيرا.",
    "اللهم إني أسألك إيمانا يباشر قلبي ، حتى أعلم أنه لايُصيبني إلا ما كتبت لي ، ورضني من المعيشة بما قسمت لي.",
    "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
    "اللهم أنت خلقت نفسي، وأنت توفاها، لك مماتها ومحياها، إن أحييتها فاحفظها، وإن أمتها فاغفر لها.",
    "اللهم إني أسألك من فضلك ورحمتك فإنه لا يملكها إلا أنت.",
    "حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "اللهم إني أسألك شهادة في سبيلك",
    " اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً ",
    "قال صلى الله عيه وسلم من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر",
    "اللهم إني أسألك حبك وحب من يحبك والعمل الذي يبلغني حبك.",
    "اللهم إني أسألك المعافاة في الدنيا والآخرة",
    "اللهم إني أعوذ بك من الفقر والقلة و الذلة، وأعوذ بك من أن اَظْلِمَ أو اُظْلَمَ .",
    "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ",
    "عن أبي ذر رضى الله عنه قال: قال رسول الله صلى الله عليه وسلمألا أخبرك بأحب الكلام إلى الله ؟ قال: قلت: يا رسول الله أخبرني بأحب الكلام إلى الله. فقال: إن أحب الكلام إلى الله: سبحان الله وبحمده",
    "اللهم إني أعوذ بك من غنى يطغيني . وأعوذ بك من فقر ينسيني.",
    "وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ * يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ * إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ ",
    "اللهم ارزقني حبك وحب من ينفعني حبه عندك.",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "اللهم ابسط علينا من بركاتك ورحمتك وفضلك ورزقك.",
    "اللهم لا تكلني إلى نفسي طرفة عين ، ولا تنزع مني صالح ما أعطيتني.",
    "اللهم يسرنا لليسرى وجنبنا العسرى واغفر لنا في الآخرة والأولى واجعلنا من أئمة المتقين.",
    "يا ربنا لك الحمد على جمالك وجلالك",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "اللهم اجعلنا ممن يؤمن بلقائك، ويرضى بقضائك، ويقنع بعطاياك، ويخشاك حق خشيتك.",
    "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ",
    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ"
  ];
  int _counter = -1;

  Future<void> _getCounter() async {
    const key = "counter";
    final SharedPreferences prefs = await SharedPreferences.getInstance();
    int counter = prefs.getInt(key) ?? 0;
    if (counter >= hadith.length) counter = 0;
    prefs.setInt(key, counter + 1);

    setState(() {
      _counter = counter;
    });
  }

  @override
  void initState() {
    super.initState();
    _getCounter();
  }

  @override
  Widget build(BuildContext context) {
    switch (_counter) {
      case -1:
        return const CircularProgressIndicator();
      default:
        int index = _counter;
        return FittedBox(
          child: AlertDialog(
            title: Text(
              "اذكر الله",
              textAlign: TextAlign.center,
              style: TextStyle(
                fontWeight: FontWeight.bold,
                fontSize: 28,
              ),
            ),
            insetPadding: const EdgeInsets.all(20),
            contentPadding: const EdgeInsets.all(0),
            content: SizedBox(
              height: MediaQuery.of(context).size.height * .25,
              width: MediaQuery.of(context).size.width * .9,
              child: Center(
                child: SingleChildScrollView(
                    child: Padding(
                  padding: const EdgeInsets.all(12.0),
                  child: Text(
                    hadith[index],
                    // "${snapshot.data} time${snapshot.data == 1 ? '' : 's'}.\n\n",
                    style: const TextStyle(
                      fontSize: 22,
                    ),

                    textAlign: TextAlign.justify,
                    textDirection: TextDirection.rtl,
                  ),
                )),
              ),
            ),
            actions: <Widget>[
              Row(
                children: [
                  InkWell(
                    onTap: () {
                      Navigator.pop(context);
                    },
                    child: const Text(
                      "   تم      ",
                      style: TextStyle(
                        fontWeight: FontWeight.bold,
                        fontSize: 20,
                      ),
                    ),
                  ),
                  // InkWell(
                  //   onTap: () {
                  //     print("counter before: $_counter");
                  //     Navigator.pop(context);
                  //     setState(() {
                  //       _counter = _counter - 2;
                  //     });
                  //     print("counter after: $_counter");
                  //   },
                  //   child: const Text(
                  //     "تأجيل",
                  //     style: TextStyle(
                  //       fontWeight: FontWeight.bold,
                  //       fontSize: 19,
                  //     ),
                  //   ),
                  // )
                ],
              ),
            ],
          ),
        );
    }
  }
}
